function showInfo(blockId) {
  let infoContent = {
      "block1": "Мавка — міфічна істота з українського фольклору, що уособлює дух природи, найчастіше лісу. Вона виглядає як молода дівчина, яка може зачаровувати людей своєю красою, але має здатність заманювати їх у лісові гущавини. За переказами, мавка часто з’являється вночі чи на світанку, залишаючи після себе легкий шелест листя або сліди на росі. Її образ пов’язаний із загадковою красою та силою природи, яку не кожен може зрозуміти або контролювати.",
      "block2": "Відьма — міфічна істота або жінка з українського фольклору, наділена магічною силою та знаннями про природу і таємничі сили. Вона часто зображується як старша жінка з мудрим, а іноді й лякливим поглядом, або ж як приваблива молода особа, яка може зачаровувати своєю магією. Вважається, що відьма може як допомагати, так і завдавати шкоди людям, зцілюючи хворих або накладаючи прокляття. Її образ пов’язаний із потужною енергією природи та знанням таємних ритуалів, які допомагають керувати стихіями та впливати на долю людей.",
      "block3": "Чугайстер — міфічний персонаж з українського фольклору, дух лісу, який захищає природу та подорожніх від злих істот. Він з'являється як високий, кремезний чоловік з густим волосяним покровом або одягнений у шубу з хутра. Вважається, що Чугайстер має добру вдачу та любить жартувати з людей, але особливо він полює на мавок, захищаючи лісових мешканців від їхніх небезпечних чарів. Він відомий своїм веселим танцем і може запросити людину приєднатися до нього; проте, той, хто прийме запрошення, мусить танцювати до знемоги.",
      "block4": "Лісовик — міфічний дух лісу в українському фольклорі, господар і охоронець лісових угідь. Він постає як високий чоловік із зеленою бородою, одягнений у мох або кору дерев, що дозволяє йому зливатися з природою. Лісовик має здатність змінювати розмір — ставати маленьким, як кущ, або високим, як дерево. Вважається, що він охороняє свої володіння, допомагає тваринам і може збивати з дороги людей, які занадто заглибилися в ліс або пошкодили дерева.",
      "block5": "Русалка — міфічна істота в українському фольклорі, водяний дух, що уособлює чарівність і небезпеку води. Зазвичай русалка зображається як прекрасна молода дівчина з довгим волоссям, яке виблискує під місячним світлом, і з м'яким, привабливим голосом. Вона живе у водоймах — річках, озерах чи ставках, і має здатність зачаровувати людей, особливо молодих чоловіків, заманюючи їх у воду.",
      "block6": "Змій — міфічний персонаж у слов'янській, зокрема українській, міфології, який символізує могутню та небезпечну силу, здатну як захищати, так і руйнувати. Змій зазвичай зображується як велика крилата істота з кількома головами (від трьох до дванадцяти), здатна вивергати вогонь і спричиняти стихійні лиха. У фольклорі Змій часто живе в печерах або горах, охороняючи величезні скарби або викрадених ним дівчат.",
      "block7": "Полудниця — міфічна істота в українському фольклорі, дух поля, який з’являється серед жнив, особливо в полудень, коли сонце стоїть високо. Її зазвичай описують як високу, струнку жінку в білому одязі або як постать у вінку з польових квітів. Полудниця з’являється раптово і може поставати перед працівниками, коли вони занадто довго працюють у спеку, нагадуючи про небезпеку виснаження.",
      "block8": "Берегиня — у слов'янській міфології, особливо в українському фольклорі, дух або божество, яке є покровителем дому, родини та всього, що пов'язано з охороною і благополуччям людей. Вона зазвичай зображується як добра жінка або матір, що має за мету захистити рід, родину та домашнє вогнище від злих сил.",
      "block9": "Кікімора — міфічна істота в українському фольклорі, яка є духом домашнього господарства, але має репутацію нечистої сили. Зазвичай її зображують як маленьку, потворну жінку або стару з довгим волоссям, що може мешкати в оселях людей, зокрема в кутках, під ліжками чи в погребах. Кікімора живе в будинку, що не вшановує традиції, і може турбувати мешканців, створюючи різні незручності.",
  };
  document.getElementById('info-content').innerHTML = infoContent[blockId];
  document.getElementById('overlay').style.display = 'flex';
}
// -----------------
document.getElementById('myForm').addEventListener('submit', function(e) {
  e.preventDefault();

  const formData = new FormData(this);
  const data = {
    name: formData.get('name'),
    email: formData.get('email'),
    message: formData.get('message')
  };

  const message = `Ім'я: ${data.name}\nEmail: ${data.email}\nПовідомлення: ${data.message}`;

  const token = '6385195670:AAF6P2tkMP85UTG1-pTcC0TNJ9XX6etENyc';
  const chat_id = '-1002289393120';
  const url = `https://api.telegram.org/bot${token}/sendMessage`;

  fetch(url, {
    method: 'POST',
    headers: { 'Content-Type': 'application/json' },
    body: JSON.stringify({
      chat_id: chat_id,
      text: message
    })
  })
  .then(response => response.json())
  .then(data => {
    if (data.ok) {
      alert('Повідомлення успішно відправлено');
    } else {
      alert('Помилка при відправці');
    }
  })
  .catch(error => {
    alert('Сталася помилка');
    console.error('Error:', error);
  });
});
// ---------------
function hideInfo() {
  document.getElementById('overlay').style.display = 'none';
}
document.querySelector('a[href="#secont"]').addEventListener('click', function(e) {
  e.preventDefault();
  document.querySelector('#about_t1').scrollIntoView({
    behavior: 'smooth'
  });
});
document.querySelector('a[href="#tree"]').addEventListener('click', function(e) {
  e.preventDefault();
  document.querySelector('#about_t2').scrollIntoView({
    behavior: 'smooth'
  });
});
document.querySelector('a[href="#four"]').addEventListener('click', function(e) {
  e.preventDefault();
  document.querySelector('#form_q').scrollIntoView({
    behavior: 'smooth'
  });
});
// -------------